---
kind: type
id: T:Autodesk.Revit.DB.FaceEdgeNode
source: html/66e250b9-081a-5a9b-6045-d779f1876e3a.htm
---
# Autodesk.Revit.DB.FaceEdgeNode

An output node that represents a Face edge.

## Syntax (C#)
```csharp
public class FaceEdgeNode : FaceDetailNode
```

## Remarks
See also: OnFaceEdge2D(FaceEdgeNode) .